Autodesk.Revit.DB.Visual.Water.CommonTintColor
The property labeled "Tint Color" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Water.CommonTintToggle
The property labeled "Tint" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Water.WaterBumpAmount
The property labeled "Wave Height" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 5".
Since:
2018.1

Autodesk.Revit.DB.Visual.Water.WaterColorByObject
The property labeled "Custom Color" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Water.WaterTintColor
The property labeled "Custom Color" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Water.WaterTintEnable
The property labeled "Color" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterTintEnableType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Water.WaterType
The property labeled "Type" from the "Water" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Water
Represents the properties of materials.
Since:
2018.1